{
  "asin": "B0CRMZ9PFR",
  "url": "https://www.amazon.com/dp/B0CRMZ9PFR",
  "timestamp": "2025-03-19T14:36:12.813400",
  "success": true,
  "title": "Stanley Quencher H2.0 Tumbler with Handle and Straw 30 oz | Flowstate 3-Position Lid | Cup Holder Compatible for Travel | Insulated Stainless Steel Cup | BPA-Free | Fuchsia",
  "current_price": 26.25,
  "rating": 4.7,
  "total_reviews": 52083,
  "availability": "In Stock",
  "seller": "Visit the STANLEY Store",
  "categories": [
    "Home & Kitchen",
    "Kitchen & Dining",
    "Dining & Entertaining",
    "Glassware & Drinkware",
    "Tumblers & Water Glasses"
  ],
  "main_category": "Tumblers & Water Glasses",
  "description": "This Quencher H2.0 is generously sized (but not oversized) with an easy-carry, comfort-grip handle and a narrow base that will fit most cup holders. Long day of meetings? Rowing class? Trip out of town? Our durable 30 oz tumbler, made with recycled stainless steel, is up to the hydration challenge. The double-wall vacuum insulation will keep your water cold for 9 hours and iced for 40 hours. And to cap things off, there’s an advanced FlowState™ lid that features a rotating cover with three positions: a straw opening designed to resist splashes with a seal that holds the reusable straw in place, a drink opening, and a full-cover top.",
  "features": [
    "YOUR DREAM TUMBLER: Whichever way your day flows, the H2.0 FlowState tumbler keeps you refreshed with fewer refills. Double wall vacuum insulation means drinks stay cold, iced or hot for hours. Choose between our 14oz, 20oz, 30oz,40oz and 64oz options depending on your hydration needs. The narrow base on all sizes (except 64oz) fits just about any car cup holder, keeping it right by your side.",
    "ADVANCED LID CONSTRUCTION: Whether you prefer small sips or maximum thirst quenching, Stanley has developed an advanced FlowState lid, featuring a rotating cover with three positions: a straw opening designed to resist splashes with a seal that holds the reusable straw in place, a drink opening, and a full-cover top for added leak resistance. We’ve also included an ergonomic, comfort-grip handle, so you can easily carry your ice-cold water to work, meetings, the gym or trips out of town.",
    "EARTH-FRIENDLY DURABILITY: Constructed of 90% recycled BPA free stainless steel for sustainable sipping, the Stanley Quencher H2.0 has the durability to stand up to a lifetime of use. Eliminate the use of single-use plastic bottles and straws with a travel tumbler built with sustainability in mind.",
    "DISHWASHER SAFE: Spend less time hunched over the sink and more time doing the things you love. Cleaning your tumbler and lid couldn't be easier, just pop them into the dishwasher. Unlike plastic bottles that retain stains & smells, this metallic beauty comes out pristine",
    "LIFETIME WARRANTY: Since 1913 we’ve promised to provide rugged, capable gear for food and drink - accessories built to last a lifetime. It’s a promise we still keep. Stanley products purchased from Stanley Resellers come with a lifetime warranty. Rest easy knowing we’ve got your back through it all."
  ]
}